{
	"pageTitle": "Poor SQL - Formateador de T-SQL Open-Source, Gratuito e Instantaneo"

	,"pageSubHeader": "Échale una mano a tu SQL con formateado instantaneo, gratuito y open-source, utilizando la biblioteca <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx\">Poor Man's T-SQL Formatter</a>. Si te gusta, descarga el <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx#Download_5\">plugin SSMS / Visual Studio</a>, el <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx#Download_5\">formateador a gran escala</a>, y/o el <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx#Download_5\">plugin WinMerge</a> para integrarlo en tu workflow y utilizarlo sin conexión - también gratuita y libremente. (O, si estas de mal humor, ¡ofuscalo!)"
	,"download": "Descargar"
	,"about": "Acerca de"
	,"tips": "Trucos"
	,"demos": "Demostraciones"

	,"language": "Idioma"
	,"english": "Inglés"
	,"french": "Francés"
	,"spanish": "Español"

	,"inputSql": "SQL Original"
	,"formattedSql": "SQL Formateado"
	,"htmlSource": "Fuente HTML"
	,"shortInstructions": "Pon tu SQL en el cuadro debajo, y haz click o tabula fuera del cuadro (no olvides probar las opciones a la derecha!)"
	,"formattedLink": "Enlace hacia este resultado formateado"

	,"colorizeOnly": "Solo Colorear"
	,"fullFormatting": "Formateado Completo"
	,"indentString": "Texto de Indentación: "
	,"spacesPerTab": "Espacios Por Tab: "
	,"maxWidth": "Ancho Máximo: "
	,"expandCommaLists": "Expandir Listas de Coma"
	,"trailingCommas": "Comas Traseras"
	,"spaceAfterComma": "Espacio Después de Coma"
	,"expandBooleanExpressions": "Expandir Expresiones Booleanas"
	,"expandCaseExpressions": "Expandir Declaraciones CASE"
	,"expandBetweenConditions": "Expandir Condiciones BETWEEN"
	,"breakJoinOnSections": "Salto en Secciones ON"
	,"uppercaseKeywords": "Palabras Clave en Mayúsculas"
	,"enableColoring": "Colorización"
	,"enableKeywordStandardization": "Estandarización de Palabras Clave"
	,"obfuscate": "Ofuscar / Minificar"

	,"parseErrorWarningText": "--ALERTA! SE ENCONTRARON ERRORES AL ANALIZAR EL CODIGO SQL! <br />"

	,"aboutBox_title": "Acerca de PoorSQL.com"
	,"aboutPara1": "PoorSQL.com es un servicio de formateado de SQL que utiliza la biblioteca <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx\">Poor Man's T-SQL Formatter</a>, una biblioteca open-source (<a href=\"https://github.com/TaoK/PoorMansTSqlFormatter/blob/master/LICENSE.txt\">AGPL</a>), C#/.Net 2.0. La biblioteca, los plugins, y el codigo fuente están todos disponibles para descargar desde la <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx#Download_5\">pagina del proyecto</a>. El <a href=\"https://github.com/TaoK/PoorMansTSqlFormatter\">código fuente está almacenado en GitHub</a>, y cualquier comentario será muy apreciado!"
	,"aboutPara2": "Dado que la página utiliza una biblioteca .Net, tiene que enviar el SQL que proporciones a un servidor (que está, en este momento, alojado en alguna parte de los EEUU por WinHost.com). Si prefieres evitar la transmisión de estos datos por la red, descarga y utilisa uno de los programas - son todos gratuitos y libres."
	,"aboutPara3": "Para estar al corriente de las actualizaciones, sigue a <a href=\"https://twitter.com/PoorSQL\" >@PoorSQL</a> en Twitter."
	,"tipsBox_title": "Trucos para PoorSQL.com"
	,"tipsIntro": "Algunos trucos:"
	,"tip_QueryString": "Puedes proporcionar el código SQL para formatear en la cadena de busqueda (querystring), con el parámetro \"inputString\"."
	,"tip_Link": "Si el tamaño del SQL no es demasiado importante, añadiremos automaticamente un enlace en la pagina del SQL formateado, para que puedas compartirlo facilmente si quieres."
	,"tip_Cookies": "Intentamos accordarnos de tus opciones seleccionadas de formateado, utilizando un cookie. Si los bloqueas, veras siempre las opciones predeterminadas cada vez que visitas esta página."
	,"tip_Bugs": "La bibliotèca de formateado es bastante nueva (su segunda version oficial), por lo cual se puede que encuentres problemas. Si ves algo particularmente feo (o, peor, un error!), ponte en contacto conmigo por favor (mi dirección está al final de la página) ou o añade un defecto en <a href=\"https://github.com/TaoK/PoorMansTSqlFormatter/issues\">el seguimiento de defectos en GitHub</a>."
	,"demosBox_title": "Demostraciones"

	,"githubStarting": "Obteniendo la lista de GitHub..."
	,"demoListIntro": "Esta es la lista de los archivos de pruebas utilizados en el proyecto Poor Man's T-SQL Formatter, illustrando el formateado de diferentes aspectos del Lenguage T-SQL:"
	,"githubError": "La recuperacion de la lista la fallado. Pongan-se en contacto conmigo por favor, mi dirección de correo electronico esta al final de la página."
	,"pleaseWait": "Obteniendo el código SQL formateado, un momento por favor..."
}