{
	"pageTitle": "Poor SQL - Formatteur de T-SQL Gratuit, Instantané et Open-Source"

	,"pageSubHeader": "Prenez pitié de votre SQL avec du formattage instantané, gratuit et open-source, utilisant la bibliothèque <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx\">Poor Man's T-SQL Formatter</a>. Si ça vous plait, téléchargez le <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx#Download_5\">plugin SSMS / Visual Studio</a>, le <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx#Download_5\">formatteur en gros</a>, et/ou le <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx#Download_5\">plugin WinMerge</a> pour l'intégrer dans votre workflow et l'utiliser hors connection - également gratuitement et librement. (Ou, si vous êtes de mauvaise humeur, obfusquez-le!)"
	,"download": "Télécharger"
	,"about": "À propos de"
	,"tips": "Astuces"
	,"demos": "Démos"

	,"language": "Langue"
	,"english": "Anglais"
	,"french": "Français"
	,"spanish": "Espagnol"

	,"inputSql": "SQL D'Entrée"
	,"formattedSql": "SQL Formatté"
	,"htmlSource": "Source HTML"
	,"shortInstructions": "Mettez votre SQL dans la boite, puis cliquez autrepart (n'oubliez pas les options à droite!)"
	,"formattedLink": "Raccourci pour ce résultat formatté"

	,"colorizeOnly": "Seulement Colorier"
	,"fullFormatting": "Formattage Complet"
	,"indentString": "Chaîne d'Indentation: "
	,"spacesPerTab": "Espaces par Tab: "
	,"maxWidth": "Largeur de ligne Maximum: "
	,"expandCommaLists": "Étendre Listes de Virgule"
	,"trailingCommas": "Virgules Trainantes"
	,"spaceAfterComma": "Espace après Virgule Étendue"
	,"expandBooleanExpressions": "Étendre Expressions Booléennes"
	,"expandCaseExpressions": "Étendre Déclarations CASE"
	,"expandBetweenConditions": "Étendre Conditions BETWEEN"
	,"breakJoinOnSections": "Saut sur Sections ON"
	,"uppercaseKeywords": "Mots-Clé en Majuscules"
	,"enableColoring": "Colorisation"
	,"enableKeywordStandardization": "Normalisation de Mots-Clé"
	,"obfuscate": "Obfusquer / Minifier"

	,"aboutBox_title": "À Propos de PoorSQL.com"
	,"aboutPara1": "PoorSQL.com est un service de formattage de SQL qui utilise la bibliothèque <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx\">Poor Man's T-SQL Formatter</a>, une bibliothèque open-source (<a href=\"https://github.com/TaoK/PoorMansTSqlFormatter/blob/master/LICENSE.txt\">AGPL</a>), C#/.Net 2.0. La bibliothèque, les plugins, et le code source sont tous disponibles à télécharger depuis la <a href=\"http://architectshack.com/PoorMansTSqlFormatter.ashx#Download_5\">page du projet</a>. Le <a href=\"https://github.com/TaoK/PoorMansTSqlFormatter\">code source est hébergé par GitHub</a>, et n'importe quel commentaire serait très apprécié!"
	,"aboutPara2": "Comme la page utilise une bibliothèque .Net, elle envoie le SQL que vous y metez à un serveur (qui est, en ce moment, hébergé quelque-part aux États-Unis par WinHost.com). Si vous préférez éviter la transmission de ces données sur le réseau, téléchargez et utilisez un des programmes - ils sont tous gratuits et libres."
	,"aboutPara3": "Pour rester au courant des mises à jour, suivez <a href=\"https://twitter.com/PoorSQL\" >@PoorSQL</a> sur Twitter."
	,"tipsBox_title": "Astuces PoorSQL.com"
	,"tipsIntro": "Quelques astuces:"
	,"tip_QueryString": "Vous pouvez proportionner le code SQL à formatter dans la chaîne de requête, avec un paramètre \"inputString\"."
	,"tip_Link": "Si la quantité de SQL est assez petite, on ajoutera automatiquement un lien sur la page du SQL formatté, au cas oû vous voudriez le partager."
	,"tip_Cookies": "On essaie de se rappeler de vos options de formattage, en utilisant un cookie. Si vous les bloquez, vous aurez simplement les options par défaut chaque fois que vous visitez."
	,"tip_Bugs": "La bibliothèque de formattage est toujours assez jeune (sa segonde version officielle), donc vous pourriez trouver des nouveaux problèmes. So vous voyez quelque-chose particulièrement moche (ou, pire, une erreur!), contactez-moi s'il vous plait (mon mail est au bout de la page) ou créez un défaut sur <a href=\"https://github.com/TaoK/PoorMansTSqlFormatter/issues\">le suivi de défauts sur GitHub</a>."
	,"demosBox_title": "Démos"

	,"parseErrorWarningText": "--ATTENTION! DES ERREURS ON ÉTÉS DÉTECTÉES PENDANT L'ANALYSE DU CODE SQL! <br />"

	,"githubStarting": "Obtenant la liste de GitHub..."
	,"demoListIntro": "Ceci est la liste des fichiers de tests utilisés dans le projet Poor Man's T-SQL Formatter, illustrant le formattage de différents aspects du language T-SQL:"
	,"githubError": "L'extraction de la liste a echouée. Contactez-moi s'il vous plait, mon addresse de courier électronique est au bout de la page."
	,"pleaseWait": "Récuperant le code SQL formatté, un moment s'il vous plait..."
}
